Revit 2027 API
BuiltInFailures.GroupFailures.ChildrenDeletedOnGroupSwap Property
 Some dependent elements were deleted by changing group type and cannot be retained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ChildrenDeletedOnGroupSwap { get; }
Public Shared ReadOnly Property ChildrenDeletedOnGroupSwap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ChildrenDeletedOnGroupSwap {
	FailureDefinitionId^ get ();
}
static member ChildrenDeletedOnGroupSwap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace